# Chapter 5. DataFrame 구조 다루기

In [1]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)
pd.set_option('display.width', 60)

In [2]:
# csv 데이터 읽어오기
data_path = './data/Learning-Pandas-Second-Edition-master/data/sp500.csv'

sp500 = pd.read_csv(data_path,
                    index_col = ['Symbol'],
                    usecols = [0, 2, 3, 7])

### 컬럼 추가

In [32]:
# insert 메서드를 통해 원하는 위치에 새로운 컬럼 추가 가능
copy = sp500.copy()

copy.insert(1, 'RoundedPrice', sp500.Price.round())
display(copy[:2])

             Sector  RoundedPrice   Price  Book Value
Symbol
MMM     Industrials         141.0  141.14      26.668
ABT     Health Care          40.0   39.60      15.573

In [34]:
# 확장을 통한 컬럼 추가
copy = sp500.copy()

copy.loc[:, 'PER'] = 0 # 전체 로우 선택 후, 새로운 컬럼 지정
display(copy)

                        Sector   Price  Book Value  PER
Symbol
MMM                Industrials  141.14      26.668    0
ABT                Health Care   39.60      15.573    0
ABBV               Health Care   53.95       2.954    0
ACN     Information Technology   79.79       8.326    0
ACE                 Financials  102.91      86.897    0
...                        ...     ...         ...  ...
YHOO    Information Technology   35.02      12.768    0
YUM     Consumer Discretionary   74.77       5.147    0
ZMH                Health Care  101.84      37.181    0
ZION                Financials   28.43      30.191    0
ZTS                Health Care   30.53       2.150    0

[500 rows x 4 columns]

In [57]:
# 해당 컬럼에 값을 채우는 방법은?
np.random.seed(11)
vals = np.random.normal(size = 500)

copy.loc[:, 'PER'] = vals
copy.loc[:, 'PER'] = pd.Series(vals, index = copy.index)

In [62]:
# 접합을 통한 컬럼 추가 - 기존의 데이터 프레임은 유지
rounded_price = pd.DataFrame({'RoundedPrice': sp500.Price.round()})

concat = pd.concat([sp500, rounded_price], axis = 1) # 새로운 데이터 프레임 생성
display(concat.head(3))
display(sp500.head(3))

             Sector   Price  Book Value  RoundedPrice
Symbol
MMM     Industrials  141.14      26.668         141.0
ABT     Health Care   39.60      15.573          40.0
ABBV    Health Care   53.95       2.954          54.0

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [66]:
# concat 결과에서는 중복된 컬럼명이 생길 수 있으며,
# 속성값으로 컬럼을 읽어올 경우 중복된 컬럼을 모두 가져온다.
concat = pd.concat([sp500, rounded_price, rounded_price], axis = 1)
display(concat.head(3))
display(concat.RoundedPrice.head(3))

,Sector,Price,Book Value,RoundedPrice,RoundedPrice
Symbol,,,,,
MMM,Industrials,141.14,26.668,141.0,141.0
ABT,Health Care,39.60,15.573,40.0,40.0
ABBV,Health Care,53.95,2.954,54.0,54.0

        RoundedPrice  RoundedPrice
Symbol
MMM            141.0         141.0
ABT             40.0          40.0
ABBV            54.0          54.0

### 컬럼 삭제

In [70]:
# del - 해당 컬럼 삭제 (원본에 대한 작업)
copy = sp500.copy()

del copy['Book Value']
display(copy.head(3))

             Sector   Price
Symbol
MMM     Industrials  141.14
ABT     Health Care   39.60
ABBV    Health Care   53.95

In [74]:
# .pop(col_name) - 해당 컬럼 삭제 및 해당 컬럼 값 리턴 (원본에 대한 작업)
copy = sp500.copy()

pop_data = copy.pop('Sector')
display(pop_data.head(3))
display(copy.head(3))

Symbol
MMM     Industrials
ABT     Health Care
ABBV    Health Care
Name: Sector, dtype: object

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954

In [95]:
# .drop() - row & column 모두 삭제 가능
# axis 값을 통해 row를 삭제할 것인지, column을 삭제할 것인지 결정 가능
# *** del, pop 과 달리 원본 데이터를 변경하는 것이 아닌, drop의 결과를 리턴하는 형태
# *** 따라서 새로운 변수에 결과를 담아주던가, inplace를 통해 원본 변경 옵션을 설정해야한다.
copy = sp500.copy()

copy.drop(['Sector'], axis = 1)
display(copy.head(3))

copy = copy.drop(['Sector'], axis = 1)
# copy.drop(['Sector'], axis = 1, inplace = True)
# copy.drop(columns = ['Sector'], inplace = True)
display(copy.head(3))

# row 삭제를 원할 때는, 삭제를 원하는 row의 인덱스 리스트와 axis 값 0 을 입력하면 된다.
# *** index label 값을 리스트로 입력해주어야 한다. not position
copy.drop(['MMM', 'ABT'], axis = 0)

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954

         Price  Book Value
Symbol
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897
ACT     213.77      55.188
ADBE     64.30      13.262
...        ...         ...
YHOO     35.02      12.768
YUM      74.77       5.147
ZMH     101.84      37.181
ZION     28.43      30.191
ZTS      30.53       2.150

[498 rows x 2 columns]

### 새 로우 추가 ***

In [114]:
# slice를 통해 잘라낸 데이터 서브셋은 원본 데이터를 참조하고 있다.
# 즉, slice한 데이터의 값을 바꾸면 원본 데이터의 값도 같이 변경되므로,
# 서브셋 데이터를 핸들링하고자 할 때는 꼭 copy를 해줘야 한다.

df1 = sp500.iloc[:3].copy()
df2 = sp500.iloc[[10, 11, 2]]

display(df1)
display(df2)

appended = df1.append(df2) # append 대신 concat을 쓰도록 하자
display(appended)

concat = pd.concat([df1, df2])
display(concat)

# 해당 작업에서 중요한 점은 합치려는 두 데이터 프레임 간에 columns 구조가 같아야 한다는 것이다.

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

             Sector  Price  Book Value
Symbol
A       Health Care  56.18      16.928
GAS       Utilities  52.98      32.462
ABBV    Health Care  53.95       2.954

C:\Users\ENURI\AppData\Local\Temp\ipykernel_55548\729617747.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  appended = df1.append(df2) # append 대신 concat을 쓰도록 하자

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954
A       Health Care   56.18      16.928
GAS       Utilities   52.98      32.462
ABBV    Health Care   53.95       2.954

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954
A       Health Care   56.18      16.928
GAS       Utilities   52.98      32.462
ABBV    Health Care   53.95       2.954

In [117]:
# if, columsn명이 다르다면?
df2.columns = ['A', 'B', 'C']

concat = pd.concat([df1, df2])
display(concat)

,Sector,Price,Book Value,A,B,C
Symbol,,,,,,
MMM,Industrials,141.14,26.668,NaN,NaN,NaN
ABT,Health Care,39.60,15.573,NaN,NaN,NaN
ABBV,Health Care,53.95,2.954,NaN,NaN,NaN
A,NaN,NaN,NaN,Health Care,56.18,16.928
GAS,NaN,NaN,NaN,Utilities,52.98,32.462
ABBV,NaN,NaN,NaN,Health Care,53.95,2.954

In [120]:
# concat 후, 각 데이터가 어떤 df로 부터 온 것인지 확인하기 위한 기능
# 이러한 인덱스의 형태를 '계층형 인덱스'라고 한다.
r = pd.concat([df1, df2], keys = ['df1', 'df2'])
display(r)

                 Sector   Price  Book Value            A  \
    Symbol
df1 MMM     Industrials  141.14      26.668          NaN
    ABT     Health Care   39.60      15.573          NaN
    ABBV    Health Care   53.95       2.954          NaN
df2 A               NaN     NaN         NaN  Health Care
    GAS             NaN     NaN         NaN    Utilities
    ABBV            NaN     NaN         NaN  Health Care

                B       C
    Symbol
df1 MMM       NaN     NaN
    ABT       NaN     NaN
    ABBV      NaN     NaN
df2 A       56.18  16.928
    GAS     52.98  32.462
    ABBV    53.95   2.954

In [128]:
# 위의 방법들은 DataFrame 간의 병합 작업이었다.
# 그렇다면 하나의 DataFrame에 값만을 row 단위로 추가하고 싶을 경우엔 어떻게 할까?
# 인덱스를 활용하여 값을 추가해주는 방식을 사용한다.

s = sp500.iloc[:3].copy()

s.loc['FOO'] = ['the sector', 100, 110]
display(s)

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954
FOO      the sector  100.00     110.000

### Row 삭제

In [133]:
# drop을 이용한 삭제 - 삭제 대상 row가 삭제된 DataFrame 사본을 리턴한다.
s = sp500.iloc[:5]

after_drop = s.drop(['ABT', 'ACN'], axis = 0) # index label 값을 통해 삭제 가능(not position)
display(after_drop)

# s를 선언할 때 .copy() 메서드를 사용하지 않았기 때문에,
# s에 대한 변경 작업은 원본 데이터인 sp500에 영향을 끼친다.
# 하지만 .drop() 메서드가 복사본을 리턴하기 때문에, .drop()의 결과인
# after_drop 데이터는 원본인 sp500과 독립된 데이터이다.

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954
ACE      Financials  102.91      86.897

In [147]:
# boolean을 이용한 삭제
# 삭제라는 개념보다는, 해당 데이터를 제외한 데이터를 삭제한다는 개념
price_less_than_300 = sp500[~(sp500.Price > 300)]
display(price_less_than_300)
print(price_less_than_300['Price'].max())

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[490 rows x 3 columns]

299.71